The problem still exists in v1.3.1:
```
Initializing provider plugins...
- Finding latest version of hashicorp/random...
- Finding latest version of mongodb/mongodbatlas...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/random v3.3.1...
- Installed hashicorp/random v3.3.1 (signed by HashiCorp)
- Installing mongodb/mongodbatlas v1.3.1...
- Installed mongodb/mongodbatlas v1.3.1 (signed by a HashiCorp partner, key ID 2A32ED1F3AD25ABF)
...
Terraform will perform the following actions:
  # mongodbatlas_cloud_backup_schedule.schedule will be created
  + resource "mongodbatlas_cloud_backup_schedule" "schedule" {
      + cluster_id               = (known after apply)
      + cluster_name             = "dmsc-theforce-sandbox"
      + id                       = (known after apply)
      + id_policy                = (known after apply)
      + next_snapshot            = (known after apply)
      + project_id               = "xxx"
      + reference_hour_of_day    = 8
      + reference_minute_of_hour = 45
      + restore_window_days      = 5
      + update_snapshots         = (known after apply)
    }
...
Error: error creating a Cloud Backup Schedule: error deleting MongoDB Cloud Backup Schedule (dmsc-theforce-sandbox): DELETE https://cloud.mongodb.com/api/atlas/v1.0/groups/619556868cad6a3ed2d10582/clusters/dmsc-theforce-sandbox/backup/schedule: 403 (request "RESOURCE_REQUIRES_ACCESS_LIST") This resource requires access through an access list of ip ranges.
  with mongodbatlas_cloud_backup_schedule.schedule,
  on main.tf line 89, in resource "mongodbatlas_cloud_backup_schedule" "schedule":
  89: resource "mongodbatlas_cloud_backup_schedule" "schedule" {
```